// Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.


// Console.WriteLine("input number: ");
// int sum = Convert.ToInt32(Console.ReadLine());


// int n = 0;

// while (sum > 0)
// {
// int num = sum % 10;
// sum = sum / 10;
// n = n + num;
// }
// Console.WriteLine("The sum of figures is: " + n);



// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

// int size = 8;
// int[] array = new int[size];
 
// for(int i = 0; i < size; i++)
// {
//     array[i] = new Random().Next(0, 200);
//     Console.Write(array[i] + " ");
// }




